KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РаспоряжениеНаОтгрузку/КАНАТ_РаспоряжениеНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РаспоряжениеНаОтгрузку</name>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ВодительСсылка</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РаспоряжениеНаОтгрузку/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
			|	ЗаказКлиента.Партнер КАК Партнер,
			|	ЗаказКлиента.АдресДоставки КАК Адрес,
			|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
			|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК НомерИДатаДоверенности,
			|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
			|	ЗаказКлиента.КАНАТ_Водитель КАК Водитель,
			|	ЗаказКлиента.КАНАТ_ВодительСсылка КАК КАНАТ_ВодительСсылка,
			|	ЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
			|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК АвтомобильМарка,
			|	ЗаказКлиента.КАНАТ_Транспорт КАК КАНАТ_Транспорт,
			|	ЗаказКлиента.Номер КАК Номер
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	МИНИМУМ(ЗаказыКлиентовОстатки.КОформлениюОстаток) КАК Количество,
			|	СУММА(ЗаказКлиентаТовары.Цена) КАК Цена,
			|	СУММА(ЗаказКлиентаТовары.Сумма) КАК СуммаБезНДС,
			|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ЗаказКлиентаТовары.СуммаСНДС) КАК СуммаСНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
			|	СУММА(ЗаказыКлиентовОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ЗаказыКлиентовОстатки
			|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказыКлиентовОстатки.ДокументОтгрузки
			|			И ЗаказКлиентаТовары.Номенклатура = ЗаказыКлиентовОстатки.Номенклатура
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			|	И ЗаказыКлиентовОстатки.КОформлениюОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика,
			|	ЗаказКлиентаТовары.СтавкаНДС,
			|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу,
			|	ЗаказКлиентаТовары.КАНАТ_Сертификат,
			|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КАНАТ_РаспоряжениеНаОтгрузку.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	Документ.КАНАТ_РаспоряжениеНаОтгрузку КАК КАНАТ_РаспоряжениеНаОтгрузку
			|ГДЕ
			|	КАНАТ_РаспоряжениеНаОтгрузку.ДокументОснование = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаРеквизиты = РезультатЗапроса[0].Выбрать();
		
		Если ВыборкаРеквизиты.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаРеквизиты);
			
			Если Не ЗначениеЗаполнено(Перевозчик) Тогда
				
				Перевозчик = ВыборкаРеквизиты.Партнер;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыборкаТовары = РезультатЗапроса[1].Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтрокаТовары = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
			
		КонецЦикла;
		
		ВыборкаНомер = РезультатЗапроса[2].Выбрать();
		
		Если ВыборкаНомер.Следующий() Тогда
			
			ПорядковыйНомер = ВыборкаНомер.ПорядковыйНомер + 1;
			
		Иначе
			
			ПорядковыйНомер = 1;
			
		КонецЕсли;
		
		Номер = СтрШаблон("%1-%2", Номер, ПорядковыйНомер);
		ДокументОснование = ДанныеЗаполнения;
		
	КонецЕсли;
КонецПроцедуры
